<template>
  <div class="market-open-page">
   <market-describe v-for="(item,index) in describeInfo" :key="index" :dredgeFlag="item.dredgeFlag" 
      :borderBottom="item.borderBottom" v-model="val"></market-describe>
   <market-priceSurface></market-priceSurface>
   <div class="agreement-box" v-if="true">
      <span>点击立即支付，即表示已阅读并同意</span>
      <span class="agreement" @click="vant">《AW大师付费协议》</span>
      <van-popup v-model="show">尊敬的AW大师用户：

欢迎您使用AW大师楼盘销售软件代理服务（以下简称“AW大师服务”）。AW大师提供的服务采用收费与免费结合的方式。您须先成为AW大师普通注册用户之后，才能继续进行收费服务的购买服务。通过购买程序支付费用后，您就可以轻松享受AW大师相关收费增值服务。在开始购买程序之前，请您首先同意并接受以下服务条款。

【注意】AW大师有责任提醒您，请仔细阅读以下全部内容，如果您不同意本服务协议的任一或全部条款内容，请不要以确认的形式（包括但不限于：点击）进行下一步操作或使用本协议项下服务。当您确认接受本服务协议或开始使用本协议项下AW大师服务时，即表示用户您与AW大师运营方（深圳尊豪网络科技股份有限公司）已达成协议关系，并自愿接受并遵守AW大师服务的所有服务协议及相关之子协议、管理规范 。

一、协议条款的确认和接受

1.1 在您决定购买AW大师服务之前，请仔细阅读本收费协议条款。您应在完全同意以下条款的前提下，才能进行购买程序。AW大师将根据以下收费协议条款为您提供收费服务。您在享受AW大师相关收费增值服务时应严格遵守本协议条款。

1.2 AW大师根据互联网的发展和中华人民共和国有关法律、法规的变化，不断地完善服务质量并依此修改服务条款。AW大师有权就本协议进行更新，且更新内容在AW大师平台公告之日起次日后生效。您的权利以及义务、购买程序及收费标准，均以最新的服务条款为准。

1.3 您在进行注册及缴费过程中点击"我同意"按钮即表示您已仔细阅读并完全接受本收费协议下的全部条款。只有您根据提示确认愿意支付相关费用，并通过本协议约定方式中的一种方式支付费用后，您才能使用AW大师的相关收费增值服务。如您拒绝支付该等费用，则不能使用相关收费增值服务。

1.4 对于未明确授权给您的楼盘代理及其他服务的权利、收益由AW大师或相关权利人所有。

1.5 您一旦购买AW大师提供的收费服务，即视为您是符合中华人民共和国法律规定的具有完全民事权利能力和完全民事行为能力及能够独立承担民事责任的主体，并了解及完全同意AW大师《用户服务协议》及本协议的各项内容 。

1.6 本收费协议中未约定事项以AW大师《用户服务协议》中的约定为准。

1.7 您一旦支付购买AW大师提供的收费服务，AW大师将为您提供相关收费增值服务。服务套餐产品到期后，您可以通过“名片”-我的楼盘列表页进行续费操作获取相关增值服务延续。

二、风险及责任

2.1 您应当遵守中国关于互联网、知识产权等方面的法律法规的规定，对自身在使用AW大师服务时的所有行为独立承担所有法律责任。

2.2 您一旦注册成功，便成为AW大师的用户，并得到一个账户及账户密码。您应自行负责妥善且正确地保管、使用、维护您在AW大师申请取得的账户及账户密码。您应对其账户密码采取必要和有效的保密措施。您对利用该账户及账户密码所进行的一切活动负全部责任；因此所衍生的任何损失或损害，AW大师不承担任何责任。非AW大师原因致使您账户密码泄漏以及因您保管、使用、维护不当造成损失的，除法律有明确规定外，AW大师无须承担与此有关的任何责任。

2.3 您明确了解并同意，本协议第5.2条款约定的付费方式为代收费运营商托收的付款方式，您通过此种付费方式付费可能存在一定的商业风险（包括但不限于不法分子利用您账户或银行卡等有价卡等进行违法活动），该等风险均会给您造成相应的经济损失。为此，您同意AW大师在充分履行其在本协议项下全部义务及勤勉谨慎义务的前提下不对您的前述风险和损失承担任何责任；并且，AW大师不承担向不法分子追究侵权责任或者代其向您承担损失的任何责任和义务。

2.4 您对本服务条款及修改有任何异议，可自动放弃使用AW大师服务。但AW大师不退还任何您已缴纳的收费服务费用。

三、收费标准

3.1 一旦您开通了AW大师的任何楼盘项目代理权，即视为您认可该项服务标明之价格；您购买成功后，该项服务即时生效。

3.2 收费费用标准：具体每项服务套餐产品的收费标准以AW大师运营方深圳尊豪网络科技股份有限公司官方发布的产品价格政策公告的具体标价为准。

四、购买步骤

4.1 对于具体购买操作步骤，AW大师会在相关页面上做每一步的明确提示。

4.2 费用支付：

企业微信应用端：服务套餐产品费用将在您点击购买之日按照AW大师官方应用产品标示价格通过微信支付的方式支付。

4.3 一旦您在AW大师官方应用产品上购买相关收费增值服务成功后，则AW大师将即时收取您的服务费用，并不提供退费服务。

五、服务周期及使用权限

5.1 每一个楼盘项目都有单独的代理服务周期，您一旦购买这个楼盘项目即视为您认可它的代理服务周期。

5.2 每一个楼盘项目的代理服务周期以楼盘项目旁边的标注期限为准。如您未在有效时间内拓客, 推介楼盘，仍将视为您已全部使用线上服务代理推介功能，AW大师概不退款。

5.3 您在线代理拓客权限：您的代理服务周期不会因其在代理期间对楼盘拓客服务的中断、终止、回退等情况而延长使用权限。

六、消费明细查询

6.1 您可通过登录AW大师，进入"名片"项下，点击”我的楼盘”-"我的消费账单"，免费查询您代理的楼盘和消费详情（包括其购买代理的楼盘名称、到期日期、购买价格、即时服务状态等）。

七、用户使用须知

7.1 对于您购买的楼盘项目代理权，您只可以私人使用，不得用于转让或赠送，因转让或者赠送引起的法律纠纷，AW大师概不承认。

7.2 您同意不会采用收费或免费的方式，全部或部分地在任何公开场合展示您购买的楼盘代理，除非您的上述行为不会构成侵权。

7.3 当您购买、使用楼盘项目代理时，禁止有下列情况发生：

7.3.1 用非法的方式或为了非法的目的使用已购买的楼盘项目；

7.3.2 将您的AW大师账户有偿或无偿提供给任何第三人，并允许他通过您的账户代理的楼盘拓客。为尽量避免前述情形的发生，AW大师运营方深圳尊豪网络科技股份有限公司将对您的AW大师账户进行如下技术性限制：若同一个账户在15分钟内有超过4个ip（含4个）访问，AW大师将关闭该AW大师的用户账户服务30分钟。

7.3.3 将收费视频复制、销售、出租或授权给任何第三方。

7.3.4 主动对AW大师用于保护其楼盘项目的任何安全措施技术进行攻克、反向操作、更改、破坏或其他篡改，或协助他人进行上述行为。

7.3.5 通过非AW大师认可的方式获得楼盘代理许可权限。

7.4 您不得通过AW大师的任何服务直接或间接地从事以下违反国家法律法规及社会公序良俗之道德保留之行为：

• 违反宪法确定的基本原则的；

• 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；

• 损害国家荣誉和利益的；

• 煽动民族仇恨、民族歧视，破坏民族团结的；

• 破坏国家宗教政策，宣扬邪教和封建迷信的；

• 散布谣言，扰乱社会秩序，破坏社会稳定的；

• 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；

• 侮辱或者诽谤他人，侵害他人合法权益的；

• 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；

• 以非法民间组织名义活动的；

• 含有法律、行政法规禁止的其他内容的。

• AW大师有权对您就使用服务之行为进行不定期监督，一旦发现涉及上述之行为，AW大师有权收回您对服务的使用权而不予退还已经支付的费用。而且，AW大师将依法向国家机关就您之行为进行举报并保留进一步追究您的行为而导致AW大师损失之权利。

7.5 为保护您的会员账户安全，避免共享密码或泄漏被盗，AW大师会员帐号仅限您个人使用，不允许转借或租赁他人。

八、楼盘销售代理软件服务

8.1 服务条款的确认和接纳

为满足您对AW大师服务的个性化开通需求，AW大师针对单个用户、单个楼盘推出了限时优惠价的平台服务费收费标准, 相关服务请关注本协议约定。若需购买开通，在您点击 “立即开通 ”选项购买该服务套餐系列产品后，本协议即构成您使用AW大师服务之先决条件。除非您接受本协议条款，否则您无权使用AW大师服务。您选择使用AW大师服务套餐产品的行为将视为您同意接受本协议约束。当您使用AW大师服务时，您的使用行为将被视为您对该单项服务的相关条款以及AW大师在该单项服务中所发出的各类公告之同意。

8.2 所有权与使用权

AW大师服务所涉及到的一切网络服务之所有权以及相关之知识产权均归AW大师运营主体深圳尊豪网络科技股份有限公司依法所有，受中华人民共和国法律及国际公约的保护。您不因使用楼盘销售代理服务而自动获得前述的任一或全部权利。而且，AW大师运营主体深圳尊豪网络科技股份有限公司可以在法定或依据《用户服务协议》对本服务协议中的任一或全部条款进行修改，或对楼盘销售代理服务进行调整。对上述修改或调整，AW大师将会在平台上予以公告，并自公告之日起次日后生效。AW大师强烈建议您，定期关注《用户服务协议》及本协议项下的条款，当您认为AW大师对所述的《用户服务协议》及本协议项下的调整不可接受时，请及时终止对AW大师所提供的相关服务，特别是楼盘销售代理软件服务的使用。

8.3 服务内容范围

AW大师服务现有单个用户开通单个项目的收费标准为期限1个月/3个月/6个月/12个月的收费标准，AW大师将会根据用户需求不断增加新的增值服务。您通过使用AW大师服务，可以定期获得以下服务内容，包括：

实时查询客户拓展动态；

名片定制精准推广服务；

楼盘定向精准推介服务；

分销商楼盘合作推介服务；

推广经纪人服务；

客户画像需求图谱分析服务；

除非AW大师另外通知，上述服务的有效期按自然天数计算。

九、变更及免责条款

9.1 AW大师对楼盘项目的代理服务周期、购买价格保留随时变更的权利，变更本规则在本平台上予以公告，并自公告之日起次日后生效 。对于由此造成服务的中断或终止而造成的任何损失，除法律有明确规定外，AW大师无需对您或任何第三方承担任何责任。

9.2 鉴于网络服务的特殊性，您同意AW大师有权随时变更、中断或终止部分或全部的网络服务。AW大师保留随时修改或中断服务的权利，并以公告形式通知。对于由此造成服务的中断或终止而造成的任何损失，除法律有明确规定外，AW大师无需对您或任何第三方承担任何责任。

9.3 对于因服务器的死机、网络的故障、数据库故障、软件升级、服务器维修、调整、升级等问题，或其他不可抗拒的事由，包括但不限于政府行为、自然灾害、黑客攻击等造成的服务中断和对您个人数据及资料造成的损失，除法律有明确规定外，AW大师不承担由此对您造成的任何损失或退还任何已缴纳的收费服务费用。但AW大师应尽可能事先进行通告。

9.4 您购买的楼盘项目开通使用期限中包含解决故障、服务器维修、调整、升级等所需用的合理时间，对上述情况所需用的时间AW大师不予补偿。

9.5 AW大师对任何间接、偶然、特殊及继起的损害不负责任，不予赔偿。

9.6 您在使用AW大师服务时，如遭受任何人身或财务的损失、损害或伤害，除法律有明确规定外，AW大师均不负责任。由于您将个人密码告知他人或与他人共享注册帐户，由此导致的任何个人资料泄露，AW大师不负任何责任。

十、中断及终止服务

10.1 在某些罕见情况下，由于权利授权问题可能致使AW大师上某些楼盘项目无法拓客。在这种情况下，除法律有明确规定外，无法退费，可以根据不同情况以其他服务替换方式给您补偿。

10.2 如您违反本服务条款中的内容，AW大师有权在通知您的情况下立即终止您已购买的所有服务，以及取消您的AW大师账户和使用权限，且不退还任何已缴纳的收费服务费用。

十一、隐私权政策

11.1 AW大师非常重视用户个人信息的保护，在您使用AW大师提供的服务时，您同意AW大师按照在AW大师平台上公布的隐私权政策收集、存储、使用、披露和保护您的个人信息。AW大师希望通过隐私权政策向您清楚地介绍AW大师对您个人信息的处理方式，因此AW大师建议您完整地阅读隐私权政策，以帮助您更好地保护您的隐私权。

十二、法律的适用和管辖

12.1 本服务条款的生效、履行、解释及争议的解决均适用中华人民共和国法律，您与AW大师在履行本协议过程中发生的争议提交深圳市南山区有管辖权法院进行管辖。

十三、解释权

13.1 本服务协议的解释权归AW大师，您同意AW大师对服务协议随时所做的任何修改。

详细个人信息政策请阅《AW大师用户服务协议》 。如您不同意请不要开通或停止使用本服务。</van-popup>
    </div>
   <open-payment ></open-payment>
  </div>
</template>
<script>
import MarketDescribe from 'COMP/MarketDescribe/'
import MarketPriceSurface from 'COMP/MarketPriceSurface/'
import OpenPayment from 'COMP/OpenPayment/'
export default {
  components: {
    MarketDescribe,
    MarketPriceSurface,
    OpenPayment
  },
  data: _ => ({
     describeInfo: [
      {dredgeFlag:false,borderBottom:false}
     ],
    show:false
  }),
  methods:{
    vant(){
      this.show=true
    }
  }
}
</script>
<style lang="less">
.market-open-page{
  width: 100%;
  background: #F7F9FA;
  .agreement-box{
    height: 65px;
    line-height:65px;
    text-align: center;
    margin:16px 0 16px 0;
    span:nth-child(1){
      font-size:10px;
      font-family:PingFang-SC-Regular;
      font-weight:400;
      color:rgba(153,153,153,1);
      line-height:14px;
    }
    .agreement{
      font-size: 12px;
      transform:scale(.8);
      height: 14px;
      font-family:PingFang-SC-Regular;
      font-weight:400;
      color:#007AE6;
    }
  }

}
</style>