<template>
    <div class="container">
        <div class="content">
            <p class="title">{{name}}用户服务协议</p>
            <p class="paragraph spacing">欢迎使用{{name}}服务平台（以下简称"本平台"）。在您注册成为本平台用户前，请仔细阅读并接受《{{name}}用户服务协议》（以下简称"本协议"）。</p>
            <p class="paragraph spacing">本协议是用户与本平台间的法律依据，请您务必认真阅读、充分理解，特别是个人信息授权条款、免责或限制条款、管辖与法律适用条款等。如果您不同意本协议的任何约定，请停止注册账户或使用本平台功能；如果您坚持继续访问和使用本平台，则视为已确知并完全同意本协议各项约定。</p>
            <p class="paragraph spacing child-title">一、平台功能</p>
            <p class="paragraph">本平台提供楼盘{{name}}功能：包括项目连接器的发布、用户订阅、用户充值、订阅扣费与续费、项目连接器效果浏览、连接器浏览客户消息互动等功能。</p>
            <p class="paragraph spacing child-title">二、用户注册</p>
            <p class="paragraph"> 1．用本平台前，须注册成为本平台用户，一个手机号仅能注册一个账户，请使用与微信账号有绑定的手机号注册。<br>
            2．用户应当是具备完全民事行为能力的自然人、法人或非法人组织。否则一经查实，本平台有权注销您的账号。<br>
            3．用户应提供本人真实、正确及完整的注册资料，并维持更新确保信息真实、正确及完整。否则一经查实，平台有权暂停或终止您的账号。<br>
            4．用户注册信息不得冒用他人信息或侵犯他人合法权益。否则一经查实，本平台有权暂停或终止账号，并追究相关责任人的法律责任。</p>
            <p class="paragraph spacing child-title">三、账号保管</p>
            <p class="paragraph">1．请妥善保管您的用户账户、登录密码、支付密码（如有）、验证码等。<br>
            2．除依法律规定或行政指令且征得本平台的同意外，用户账户不得以任何方式转让、借用、赠与或继承，登录密码、支付密码（如有）和验证码不得对任何第三方提供或泄露，否则，由此造成的一切损失，概由用户自行承担或赔偿，本平台不承担任何责任。<br>
            3．如用户发现账户无法使用或危及账户安全的情形，请立即与本平台联系并通知本平台暂停或冻结相关账户服务。本平台对在采取行动前已经产生的后果（包括但不限于用户的任何损失）不承担任何责任。</p>
            <p class="paragraph spacing child-title">四、信息授权</p>
            <p class="paragraph">1．本平台有权自行或委托第三方对用户的信息进行核实和使用。<br>
            2．用户同意授权本平台收集并使用用户信息，包括但不限于用户姓名、手机号码、微信账号等信息，同意授权本平台通过第三方对用户信息进行验证，以确认用户信息的真实性、一致性。<br>
            3．用户同意授权本平台查询和使用储存于第三方的用户征信信息或信用信息，用于评估为用户提供服务的条件和控制相关风险。<br>
            4．用户同意授权本平台利用用户信息进行数据分析（如购买行为分析、使用情况分析、市场调查、促销活动等）以便经营、评估和完善本平台服务。<br></p>
            <p class="paragraph spacing child-title">五、信息披露</p>
            <p class="paragraph">本平台不会出售或以其他方式共享用户信息，但本协议中已列明的及以下情况除外：<br>
            1．根据法律、法规或法律程序（如法院法令或传召出庭令）的规定；<br>
            2．根据政府部门（如行政机构、执法机构）的要求；<br>
            3．第三方服务提供者：本平台有可能聘请外部公司或个人代表本平台提供某些商品或服务，如：发送信息或电子邮件、分析数据、提供市场营销帮助、提供搜索结果和链接、处理收/付款事项以及提供客户服务。在该等情况下，本平台可能会共享用户信息。本平台会要求第三方依法使用用户信息，并对用户信息进行保密。<br>
            4．其他平台认为必要的情形。</p>
            <p class="paragraph spacing child-title">六、特别声明</p>
            <p class="paragraph">1．本平台的服务仅依其当前所呈现的状况，对于任何用户信息或个人化设定之时效、删除、传递错误、未予储存或其它任何问题，本平台不承担任何责任。<br>
            2．本平台有权不经事先通知为维护、升级或其它目的暂停相关服务。<br>
            3．本平台有权随时修改本协议、版权说明等文件，并在本平台公示，而无需另行单独通知用户，变更后的文件一经平台公示立即自动生效。<br>
            4．本平台有权不时推出的新产品，均无条件适用本协议，用户如使用本平台新产品或新功能，视为用户同意本协议全部条款。<br>
            5．用户在本平台上发布的内容不得侵犯任何第三方的合法权益，否则，因此发生的任何投诉、纠纷、赔偿、诉讼、仲裁等争议而产生的一切法律后果均由您自行承担。同时，用户应当赔偿给本平台造成的一切直接和间接损失。<br>
            6．如果用户利用本平台网络服务实施侵权行为的，在被侵权人以书面形式通知本平台相关侵权行为、并提供相关证据的情况下，本平台有权采取删除、屏蔽、断开链接等必要措施以防止侵权结果的扩大。</p>
            <p class="paragraph spacing child-title">七、隐私保护</p>
            <p class="paragraph">本平台保证不对外公开或者向任何第三方提供单个用户的注册资料以及用户在使用网络服务时存储在本平台的非公开内容和信息，但下列情况除外：<br>
            1．本平台事先获得用户明确授权,或为用户提供服务所需；<br>
            2．遵守有关法律法规的规定，向国家有关机关提供；<br>
            3．保持维护本平台的知识产权和其他重要权利；<br>
            4．为维护社会公众利益、维护第三方合法权益；<br>
            5．在紧急情况下维护用户个人和社会大众的隐私安全；<br>
            6．为完成合并、分立、收购或资产转让而转移；<br>
            7．根据本协议相关规定或者本平台认为必要的其他情况下。</p>
            <p class="paragraph spacing child-title">八、知识产权</p>
            <p class="paragraph">1．用户接受本协议，即表明用户主动将其在任何时间段在本平台发表的任何形式的信息内容的财产性权利等任何可转让的权利，全部独家且不可撤销地转让予本平台所有，用户同意本平台有权就任何主体侵权而单独提起诉讼。<br>
            2．用户发布的信息、文字、图片等资料如侵犯了第三方的知识产权或其他权利，责任由信息发布者本人承担，本平台对此不承担责任。<br>
            3．本平台提供的服务中所包含的任何文本、图片、图形、软件、音频和/或视频资料均受版权、专利、商标和/或其它财产所有权法律的保护，未经相关权利人及本平台的书面同意，上述资料均不得对外直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。</p>
            <p class="paragraph spacing child-title">九、免责声明</p>
            <p class="paragraph">
            平台不对下列行为承担责任：<br>
            1．本平台可能提供与其他网站或资源的链接，但不保证外部链接的准确性、完整性及安全性，对于用户依赖于该外部链接指向的网页上的任何内容（包括但不限于广告、产品或其他资料）而产生的损失，本平台不承担任何责任。<br>
            2．本平台会采取行业标准的措施保护用户信息的安全，但本平台不能确信或保证任何个人信息的安全性。<br>
            3．本平台不承诺对用户的存储信息进行无限期保留。<br>
            4．本平台基于互联网提供服务，不可避免存在个别不良信息、网络安全和网络故障问题。但以上问题并非由本平台原因造成，由此产生的侵害，本平台不承担责任。<br>
            5．本平台对下列不可抗力行为免责：信息网络设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，暴乱，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务。
        </p>
        <p class="paragraph spacing child-title">十、争议解决</p>
        <p class="paragraph">1．用户之间发生争议可以请求本平台进行调解，调解不成的应当按照租赁合同的约定另行起诉。<br>
            2．平台用户之间发生争议或对本平台运行管理不服的可以向相关部门投诉。<br>
            3．用户与平台之间产生争议、纠纷，本平台会与用户友好协商解决；协商不成的，任何一方均有权向深圳国际仲裁院申请仲裁解决。</p>
            <p class="paragraph spacing child-title">十一、协议签署</p>
            <p class="paragraph" style="margin-bottom: 0.5rem"> 1．如您对本协议内容有疑问，可向平台客服咨询。<br>
            2．一旦点击"注册"按钮并成功注册，则视为您已完全理解接受本协议，应当受本协议条款的约束。</p>
        </div>
    </div>
</template>
<script>
export default {
  data: () => ({
    name: ''
  }),
  created() {
    // this.name = this.$route.query.name
  }
}
</script>
<style lang="less">
.container {
  width: 100%;
  height: 100%;
  .content {
    width: 100%;
    padding-left: 22px;
    padding-right: 30px;
    margin-top: 34px;
    box-sizing: border-box;
    .title {
      color: #333333;
      font-size: 20px;
      font-weight: bold;
    }
    .spacing {
      margin-top: 22px;
    }
    .paragraph {
      color: #333333;
      font-size: 15px;
    }
    .child-title {
      font-weight: bold;
    }
  }
}
</style>
